app/views/professors/_form.html.erb

    <%= f.label :universidade %><br>
<%= f.collection_select :universidade_id,Universidade.all,:id,:nome %>
---
SELECT "universidades".* FROM "universidades"