app/controllers/professors_controller.rb

  def index
    @professors = Professor.all
---
SELECT "professors".* FROM "professors"

  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save
---
INSERT INTO "professors" ("nome_completo", "universidade_id", "data_admissao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome_completo", "mariana"], ["universidade_id", 2], ["data_admissao", "2016-04-10"], ["created_at", "2016-04-10 15:31:22.101948"], ["updated_at", "2016-04-10 15:31:22.101948"]]

  def destroy
    @professor.destroy
---
DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 1]]

    def set_professor
      @professor = Professor.find(params[:id])
---
SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT 1  [["id", 9]]