app/controllers/universidades_controller.rb

  def index
    @universidades = Universidade.all
---
SELECT "universidades".* FROM "universidades"

  def create
    @universidade = Universidade.new(universidade_params)

    respond_to do |format|
      if @universidade.save
---
INSERT INTO "universidades" ("nome", "cidade", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "UFRJ"], ["cidade", "Rio de Janeiro "], ["created_at", "2016-04-07 00:34:10.101185"], ["updated_at", "2016-04-07 00:34:10.101185"]]

    def set_universidade
      @universidade = Universidade.find(params[:id])
---
SELECT  "universidades".* FROM "universidades" WHERE "universidades"."id" = ? LIMIT 1  [["id", 5]]